work/interface_conf/PRODCT_SQL/CR2018000019-JANGTAI_APP/INTERFACE_XML/江泰-空中活动-境内-方案一-报文样例.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.interf.sinosoft.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:proposalPrepare>
         <!--Optional:-->
         <CommonAccidentProposalInfo>
				<agentCode>M00000000008</agentCode>
				<businessNature>k</businessNature>
				<classCode>29</classCode>
				<startDate>2018-04-22T00:00:00</startDate>
				<endDate>2018-04-25T23:59:59</endDate>
				<operateDate>2018-02-26T15:05:30</operateDate>
				<orderId>JTHW0000000000012</orderId>
				<planCode>P292018JTJJ001201</planCode>
				<policySort>0</policySort>
				<policyType>2</policyType>
				<riskCode>2975</riskCode>
				<sumAmount>1167000</sumAmount>
				<sumPremium>90.00</sumPremium>
				<planFeeInfo>
					<currency>CNY</currency>
					<delinquentFee>90.00</delinquentFee>
					<payNo>1</payNo>
					<payReason>R10</payReason>
					<planFee>90.00</planFee>
					<serialNo>1</serialNo>
				</planFeeInfo>
				<sumQuantity>3</sumQuantity>
				<proposalAppliInfo>
					<identifyNumber>222401199306014520</identifyNumber>
					<identifyType>01</identifyType>
					<insuredName>金庆玲</insuredName>
					<phoneNumber>13269206880</phoneNumber>
					<birthDate>1993-06-01</birthDate>
					<postAddress>通信地址123</postAddress>
					<identifyDate>2020-06-01</identifyDate>
					<insuredNature>3</insuredNature>
					<insuredAddress/>
					<insuredIdentity/>
					<sex>2</sex>
					<mobile/>
					<email>wei.liu@hi-ins.com.cn</email>
					<postCode/>
					<bank/>
					<account/>
					<linkerName/>
					<nationalityCode/>
				</proposalAppliInfo>
				<proposalInsuredInfoList>
					<age>24</age>
					<birthDate>1991-06-01</birthDate>
					<identifyNumber>222401199306014520</identifyNumber>
					<identifyType>01</identifyType>
					<insuredFlag>1</insuredFlag>
					<insuredIdentity>01</insuredIdentity>
					<insuredName>金庆玲</insuredName>
					<insuredNature>3</insuredNature>
					<phoneNumber/>
					<serialNo>0</serialNo>
					<sex>2</sex>
					<relateSerialNo>0</relateSerialNo>
					<mobile/>
					<email/>
					<postAddress/>
					<postCode/>
					<bank/>
					<account/>
					<linkerName/>
					<nationalityCode/>
					<benefitFlag/>
					<benefitRate>100</benefitRate>
					<occupationCode/>
					<insuredAddress/>
				</proposalInsuredInfoList>
				<proposalInsuredInfoList>
					<age>24</age>
					<birthDate>1992-06-01</birthDate>
					<identifyNumber>222401199306014520</identifyNumber>
					<identifyType>01</identifyType>
					<insuredFlag>1</insuredFlag>
					<insuredIdentity>01</insuredIdentity>
					<insuredName>金庆玲1</insuredName>
					<insuredNature>3</insuredNature>
					<phoneNumber/>
					<serialNo>0</serialNo>
					<sex>2</sex>
					<relateSerialNo>0</relateSerialNo>
					<mobile/>
					<email/>
					<postAddress/>
					<postCode/>
					<bank/>
					<account/>
					<linkerName/>
					<nationalityCode/>
					<benefitFlag/>
					<benefitRate>100</benefitRate>
					<occupationCode/>
					<insuredAddress/>
				</proposalInsuredInfoList>
				<proposalInsuredInfoList>
					<age>24</age>
					<birthDate>1993-06-01</birthDate>
					<identifyNumber>222401199306014520</identifyNumber>
					<identifyType>01</identifyType>
					<insuredFlag>1</insuredFlag>
					<insuredIdentity>01</insuredIdentity>
					<insuredName>金庆玲2</insuredName>
					<insuredNature>3</insuredNature>
					<phoneNumber/>
					<serialNo>0</serialNo>
					<sex>2</sex>
					<relateSerialNo>0</relateSerialNo>
					<mobile/>
					<email/>
					<postAddress/>
					<postCode/>
					<bank/>
					<account/>
					<linkerName/>
					<nationalityCode/>
					<benefitFlag/>
					<benefitRate>100</benefitRate>
					<occupationCode/>
					<insuredAddress/>
				</proposalInsuredInfoList>
				<requestInfo>
					<password>c64fe1a8</password>
			          <user>jiangtai</user>
			          <transcationCode>JTJJ-HW-201804210001</transcationCode>
				</requestInfo>
				<riskInfoList>
					<amount>150000</amount>
					<kindCode>2975C01</kindCode>
					<premium>0</premium>
				</riskInfoList>
				<riskInfoList>
					<amount>20000</amount>
					<kindCode>2975F01</kindCode>
					<premium>0</premium>
				</riskInfoList>
				<riskInfoList>
					<amount>200000</amount>
					<kindCode>2975F06</kindCode>
					<premium>0</premium>
				</riskInfoList>
				<riskInfoList>
					<amount>9000</amount>
					<kindCode>2975F13</kindCode>
					<premium>0</premium>
				</riskInfoList>
				<riskInfoList>
					<amount>10000</amount>
					<kindCode>2975F07</kindCode>
					<premium>0</premium>
				</riskInfoList>
				<productCode>P292018JTJJ0012</productCode>
			</CommonAccidentProposalInfo>
      </ser:proposalPrepare>
   </soapenv:Body>
</soapenv:Envelope>